### Terraform Plan
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.lambda.aws_iam_role_policy.lambda_custom will be updated in-place
  ~ resource "aws_iam_role_policy" "lambda_custom" {
        id     = "DnDn-PRD-Lambda-Role:LambdaCustomPolicy"
        name   = "LambdaCustomPolicy"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::dndn-prd-s3/canonical/*"
                    },
                  - {
                      - Action   = "sts:AssumeRole"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::*:role/DnDnOpsAgentRole"
                    },
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:ap-northeast-2:387721658341:secret:rds!db-dd3bcaeb-34cd-4d0d-84ec-0174f3fda390-NdyEiT"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.lambda.aws_lambda_function.finding_enricher will be updated in-place
  ~ resource "aws_lambda_function" "finding_enricher" {
        id                             = "dndn-prd-lmd-finding-enricher"
        tags                           = {
            "Name" = "dndn-prd-lmd-finding-enricher"
        }
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "ASSUME_ROLE_EXTERNAL_ID" = ""
              - "CUSTOMER_ROLE_NAME"      = "DnDnOpsAgentRole"
              - "OUTPUT_BUCKET"           = "dndn-prd-s3"
              - "RDS_SECRET_ARN"          = "arn:aws:secretsmanager:ap-northeast-2:387721658341:secret:rds!db-dd3bcaeb-34cd-4d0d-84ec-0174f3fda390-NdyEiT"
            } -> (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.health_enricher will be updated in-place
  ~ resource "aws_lambda_function" "health_enricher" {
        id                             = "dndn-prd-lmd-health-enricher"
        tags                           = {
            "Name" = "dndn-prd-lmd-health-enricher"
        }
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "ASSUME_ROLE_EXTERNAL_ID" = ""
              - "CUSTOMER_ROLE_NAME"      = "DnDnOpsAgentRole"
              - "OUTPUT_BUCKET"           = "dndn-prd-s3"
              - "RDS_SECRET_ARN"          = "arn:aws:secretsmanager:ap-northeast-2:387721658341:secret:rds!db-dd3bcaeb-34cd-4d0d-84ec-0174f3fda390-NdyEiT"
            } -> (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # module.rds.aws_secretsmanager_secret.app_db will be created
  + resource "aws_secretsmanager_secret" "app_db" {
      + arn                            = (known after apply)
      + description                    = "Lambda용 DB 연결 정보 (host/port/username/password/dbname)"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "dndn-prd-app-db"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "Name" = "DnDn-PRD-APP-DB-SECRET"
        }
      + tags_all                       = {
          + "Environment" = "PRD"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "DnDn-PRD-APP-DB-SECRET"
          + "Project"     = "DnDn"
        }
    }

  # module.rds.aws_secretsmanager_secret_version.app_db will be created
  + resource "aws_secretsmanager_secret_version" "app_db" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.security_groups.aws_security_group.node will be updated in-place
  ~ resource "aws_security_group" "node" {
        id                     = "sg-09b4cc394648b323a"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "elbv2.k8s.aws/targetGroupBinding=shared"
              - from_port        = 3000
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0104d4b8d6d99d3b8",
                ]
              - self             = false
              - to_port          = 8080
            },
            # (4 unchanged elements hidden)
        ]
        name                   = "DnDn-PRD-SG-NODE"
        tags                   = {
            "Name" = "DnDn-PRD-SG-NODE"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 0 to destroy.

```